#+BLOG: noise on the net
#+POSTID: 487
#+ORG2BLOG:
#+DATE: [2024-06-09 dom 22:45]
#+OPTIONS: toc:t num:nil todo:nil pri:nil tags:nil ^:nil
#+CATEGORY: Machine learning
#+TAGS: Rust
#+DESCRIPTION: Completing the creation of a classification decision tree in Rust
#+TITLE: Growing a (Decision) Tree

#+begin_src dot :file images/post017_full_tree_result.png :exports results
digraph {
rankdir = BT;
subgraph{
node1 [label="petal_length > 2.45\ngini: 3.33e-1", shape="box" style="filled", fillcolor="#fce283"];
node3 [label="Setosa 1.00", shape="box", style="rounded,filled", fillcolor="#95fc83"];
node2 [label="petal_width > 1.75\ngini: 1.10e-1", shape="box" style="filled", fillcolor="#fce283"];
node5 [label="petal_length > 4.95\ngini: 8.56e-2", shape="box" style="filled", fillcolor="#fce283"];
node11 [label="petal_width > 1.65\ngini: 0.00e0", shape="box" style="filled", fillcolor="#fce283"];
node23 [label="Versicolor 1.00", shape="box", style="rounded,filled", fillcolor="#95fc83"];
node22 [label="Virginica 1.00", shape="box", style="rounded,filled", fillcolor="#95fc83"];
node10 [label="petal_width > 1.55\ngini: 2.22e-1", shape="box" style="filled", fillcolor="#fce283"];
node21 [label="Virginica 1.00", shape="box", style="rounded,filled", fillcolor="#95fc83"];
node20 [label="petal_length > 5.45\ngini: 0.00e0", shape="box" style="filled", fillcolor="#fce283"];
node41 [label="Versicolor 1.00", shape="box", style="rounded,filled", fillcolor="#95fc83"];
node40 [label="Virginica 1.00", shape="box", style="rounded,filled", fillcolor="#95fc83"];
node4 [label="petal_length > 4.85\ngini: 2.90e-2", shape="box" style="filled", fillcolor="#fce283"];
node9 [label="sepal_width > 3.10\ngini: 0.00e0", shape="box" style="filled", fillcolor="#fce283"];
node19 [label="Virginica 1.00", shape="box", style="rounded,filled", fillcolor="#95fc83"];
node18 [label="Versicolor 1.00", shape="box", style="rounded,filled", fillcolor="#95fc83"];
** Pre-order depth first traversal
in a previoust [[https://noiseonthenet.space/noise/2024/04/climbing-a-binary-tree/][post]] I show how to create a depth first traversal
algorithm.

To be more specific it was a *post-order* traversal: you can find more details
about the kind of traversal algorithms [[https://en.wikipedia.org/wiki/Tree_traversal][in this Wikipedia page]].

To draw our tree we now need a *pre-order* traversal iterator: [[https://noiseonthenet.space/noise/2024/04/climbing-a-binary-tree/#comment-11][Caleb Sander Mateos]]
suggested me in a comment how to use a stack to implement this kind of
traversal: my code follows

I added some more useful information to the iterator result
- the current node depth
- its number according to the binary position described [[https://noiseonthenet.space/noise/2024/03/stacking-bits/][here]]
- a boolean describing if the current node is a leaf

#+begin_src rust
pub struct PreOrderTraversalIter<'a, T>{
    stack: Vec<TreeStackItem<'a, T>>
}

pub struct TreeItem<'a, T>{
    pub id: usize,
    pub level: usize,
    pub value: & 'a T,
    pub leaf: bool
}

struct TreeStackItem<'a, T>{
    id: usize,
    level: usize,
    node: & 'a Node<T>
}

impl<'a, T> PreOrderTraversalIter<'a, T>{
    fn new(tree: & 'a Tree<T>) -> PreOrderTraversalIter<'a, T>{
        match tree.root {
            None => PreOrderTraversalIter { stack: Vec::new() },
            Some(ref node) => PreOrderTraversalIter {
                stack: vec![
                    TreeStackItem{
                        id: 1,
                        level: 1,
                        node: & node
                    }],
            },
        }
    }
}

impl<'a, T> Iterator for PreOrderTraversalIter<'a, T>{
    type Item = TreeItem<'a, T>;
    fn next(& mut self) -> Option<Self::Item> {
        if let Some(item) = self.stack.pop() {
            let mut leaf: bool = true;
            if let Some(ref left) = item.node.left{
                self.stack.push(
                    TreeStackItem{
                        id: item.id << 1,
                        level: item.level + 1,
                        node: & left
                    });
                leaf = false;
            }
            if let Some(ref right) = item.node.right{
                self.stack.push(
                    TreeStackItem{
                        id: (item.id << 1) + 1,
                        level: item.level + 1,
                        node: & right
                    });
                leaf = false;
            }
            Some(
                TreeItem{
                    id: item.id,
                    level: item.level,
                    value: & item.node.value,
                    leaf
                })
        }else{
            None
        }
    }
}

#+end_src

#+RESULTS:
: error: Could not compile `cargoRLmMQN`.

